This directory contains the R code used to simulate and analyze the
data presented in the article: "Pitfalls of mapping functional and
molecular human brain imaging data from separate cohorts ".

* Organisation of the folders

- *source*: real data (not exported on Github)
- *results*: raw simulation results produced by =BATCH_simulationABC.R=,
  =BATCH_simulationDE.R= (not exported on Github), summary of the
  simulation results produced by =BUILD.R=, results from the real data
  analysis produced by =ANALYSIS.R=.
- *output*: files tracking the execution of the simulations. Generated
  by =BATCH_simulationABC.R= and =BATCH_simulationDE.R= but not
  exported on Github.
- *tables*: tables produced by the R files =table1.R=, =table2.R= in docx
  format.
- *figures*: figures produced by the R files =figure1.R=, =figure2.R=,
  and =figure3.R= in pdf and png format.

* Organisation of the R files

- =ANALYSIS.R= (real data analysis): evaluate the correlation between
  BPND and fMRI with strategy 1 to 3. Results are exported in the
  files =strategy1.rds=, =strategy2.rds=, =strategy3.rds= (results
  folder). Also exports the estimated mean, variance, and correlation
  parameters of the linear mixed model from strategy 3
  (=strategy3-lmm-param.rds=, results folder), name of the brain
  regions (=regionName.rds=, results folder) and the regional mean
  BPND and CBF values (=df2cohort.rds=, results folder). Require the
  dataset =data.csv= placed in a folder called source.
- =BATCH_simulationABC.R= and =BATCH_simulationDE.R=: run the
  simulations with slurm scheduler. Use results from the real data
  analysis (=strategy3-lmm-param.rds=, results folder) to parametrise
  the data generating mechanism.
- =BUILD.R=: collect the simulation results and summarize them into
  =simulation-summary.rds= (results folder).
- =cor.testIID.R= and =FCT.R=: define functions used by other R files.
- =figure1.R=, =figure2.R=, =figure3.R=: generate figures in pdf or
  png format based on data stored in the result folder.
- =table1.R=, =table2.R=: generate tables in docx format based on data
  stored in the result folder.

* Version of R and R packages
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(LMMstar)
library(data.table)
library(ggplot2)
library(ggrepel)
library(ggpubr)
library(officer)
library(flextable)

sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 4.2.0 (2022-04-22 ucrt)
Platform: x86_64-w64-mingw32/x64 (64-bit)
Running under: Windows 10 x64 (build 22621)

Matrix products: default

locale:
[1] LC_COLLATE=Danish_Denmark.utf8  LC_CTYPE=Danish_Denmark.utf8   
[3] LC_MONETARY=Danish_Denmark.utf8 LC_NUMERIC=C                   
[5] LC_TIME=Danish_Denmark.utf8    

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] flextable_0.8.3   officer_0.5.1     ggpubr_0.4.0      ggrepel_0.9.1    
[5] ggplot2_3.5.1     data.table_1.17.0 LMMstar_1.1.0    

loaded via a namespace (and not attached):
 [1] xfun_0.43           tidyselect_1.2.0    purrr_1.0.2        
 [4] listenv_0.9.1       splines_4.2.0       lattice_0.20-45    
 [7] carData_3.0-5       colorspace_2.1-1    vctrs_0.6.5        
[10] generics_0.1.3      htmltools_0.5.8.1   base64enc_0.1-3    
[13] survival_3.3-1      rlang_1.1.5         pillar_1.10.1      
[16] glue_1.8.0          withr_3.0.2         gdtools_0.2.4      
[19] uuid_1.1-0          lifecycle_1.0.4     lava_1.8.1         
[22] munsell_0.5.1       ggsignif_0.6.3      gtable_0.3.6       
[25] zip_2.3.1           future_1.34.0       evaluate_0.23      
[28] codetools_0.2-18    knitr_1.46          fastmap_1.1.1      
[31] parallel_4.2.0      broom_1.0.6         Rcpp_1.0.14        
[34] openssl_2.1.2       scales_1.3.0        backports_1.4.1    
[37] abind_1.4-5         parallelly_1.42.0   systemfonts_1.0.6  
[40] askpass_1.2.0       digest_0.6.37       rstatix_0.7.2      
[43] dplyr_1.1.3         grid_4.2.0          cli_3.6.4          
[46] tools_4.2.0         magrittr_2.0.3      tibble_3.2.1       
[49] tidyr_1.3.0         car_3.1-0           future.apply_1.11.3
[52] pkgconfig_2.0.3     Matrix_1.5-1        xml2_1.3.6         
[55] rmarkdown_2.26      R6_2.6.1            globals_0.16.3     
[58] nlme_3.1-158        compiler_4.2.0
#+end_example
